app/views/providers/_form.html.erb

    <div class="input-group">
      <%= f.select :product_ids, Product.all.collect {|x| [x.name, x.id]}, {}, :multiple => true %>
---
SELECT "products".* FROM "products"