app/views/providers/show.html.erb

SELECT COUNT(*) FROM "products" INNER JOIN "provider_products" ON "products"."id" = "provider_products"."product_id" WHERE "provider_products"."provider_id" = ?  [["provider_id", 1]]
---
		  <strong>Productos que distribuye:</strong>
		  <%= pluralize(@provider.products.count, "producto") %>