app/views/orders/index.html.erb

            <td class="hidden-xs text-center"><%= order.table %></td>
            <td class="hidden-xs text-center"><%= order.order_items.count %></td>
---
SELECT "orders".* FROM "orders"