app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."active" = 't' LIMIT 1
---
  def index
    @categories = Category.all

    respond_to do |format|
      format.html
      format.json { render json: Category.where(active:true) }

INSERT INTO "categories" ("active", "created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["active", true], ["created_at", Sat, 22 Nov 2014 04:45:15 UTC +00:00], ["description", "Las más exquisitas bebidas"], ["name", "Bebidas"], ["updated_at", Sat, 22 Nov 2014 04:45:15 UTC +00:00]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

UPDATE "categories" SET "active" = ?, "updated_at" = ? WHERE "categories"."id" = 3  [["active", false], ["updated_at", Sun, 23 Nov 2014 22:44:36 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]
---
  def destroy
    @category.destroy