app/controllers/products_controller.rb

INSERT INTO "products" ("category_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["created_at", Sat, 22 Nov 2014 04:47:12 UTC +00:00], ["name", ""], ["updated_at", Sat, 22 Nov 2014 04:47:12 UTC +00:00]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "picture" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["picture", "6to4_tunnel.png"], ["updated_at", Sun, 23 Nov 2014 01:53:04 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

SELECT "products".* FROM "products" WHERE "products"."category_id" IS NULL
---
  def filter_by_cat
    @products = Product.where(category_id:params[:id])