app/controllers/providers_controller.rb

  def index
    @providers = Provider.all
---
SELECT "providers".* FROM "providers"

  def create
    @provider = Provider.new(provider_params)
    @provider.product_ids = params[:provider][:product_ids]

    respond_to do |format|
      if @provider.save
---
INSERT INTO "provider_products" ("created_at", "product_id", "provider_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 22 Nov 2014 23:54:56 UTC +00:00], ["product_id", 4], ["provider_id", 8], ["updated_at", Sat, 22 Nov 2014 23:54:56 UTC +00:00]]
INSERT INTO "providers" ("created_at", "name", "phone", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 22 Nov 2014 06:34:23 UTC +00:00], ["name", "Colgap"], ["phone", "3134690778"], ["updated_at", Sat, 22 Nov 2014 06:34:23 UTC +00:00]]

  def destroy
    @provider.destroy
---
DELETE FROM "providers" WHERE "providers"."id" = ?  [["id", 1]]

    def set_provider
      @provider = Provider.find(params[:id])
---
SELECT "providers".* FROM "providers" WHERE "providers"."id" = ? LIMIT 1  [["id", "1"]]