app/controllers/sells_controller.rb

  def index
    @sells = Sell.all
---
SELECT "sells".* FROM "sells"

  def create
    @sell = Sell.new(sell_params)

    order = Order.where(table: @sell.table, pay:false).last
    order.pay = true
    order.save

    subtotal = 0
    order.order_items.each do |item|
      subtotal = subtotal + item.product.price * item.quantity
    end
    @sell.order = order
    @sell.subtotal = subtotal
    @sell.total = subtotal + subtotal * 0.16

    respond_to do |format|
      if @sell.save
---
SELECT "orders".* FROM "orders" WHERE (`table` = '%1%') ORDER BY "orders"."id" DESC LIMIT 1
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
INSERT INTO "sells" ("created_at", "order_id", "subtotal", "table", "total", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 23 Nov 2014 22:02:51 UTC +00:00], ["order_id", 1], ["subtotal", 200.0], ["table", 1], ["total", 232.0], ["updated_at", Sun, 23 Nov 2014 22:02:51 UTC +00:00]]

  def destroy
    @sell.destroy
---
DELETE FROM "sells" WHERE "sells"."id" = ?  [["id", 1]]

    def set_sell
      @sell = Sell.find(params[:id])
---
SELECT "sells".* FROM "sells" WHERE "sells"."id" = ? LIMIT 1  [["id", "1"]]