app/views/products/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <div class="input-group">
      <%= f.select :category_id, options_for_select(Category.all.collect {|cat| [cat.name, cat.id]})%>