app/views/sells/show.html.erb

			</tr>
			<% @sell.order.order_items.each do |item|%>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."sell_id" = ? ORDER BY "orders"."id" ASC LIMIT 1  [[nil, 2]]